[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/khetansarvesh/MSML_602/blob/main/HW1/Homework2_PandasSQL_DATA602__121124586_Khetan.ipynb)

# **HOMEWORK 2: PANDAS and SQL (TOTAL 80)**
## **DUE: *SEPTEMBER 26, 2024 @ 11:59 PM***

---------------------
#### **DATASET DESCRIPTION**

The [NCEI/WDS Global Significant Volcanic Eruptions Database](https://www.ncei.noaa.gov/access/metadata/landing-page/bin/iso?id=gov.noaa.ngdc.mgg.hazards:G10147) is a very comprehensive collection of +600 volcanic eruptions dating from 4360 BC to the present. Due to the nature of this assignment, we will be dealing with relatively newer volcanoes (in which some are still obviously still older than anyone on Earth currently). Each eruption in the database is classified as significant if it meets one or more criteria, such as causing fatalities, incurring **damage on property** (**+$1 million**), reaching a **Volcanic Explosivity Index (VEI)** of **6 or higher**, generating a tsunami, or being linked to a significant earthquake. The VEI is a scale that measures the explosiveness of volcanic eruptions, providing insight into the magnitude and potential consequences of the eruptions. The database includes detailed information on the location, type of volcano, last known eruption, VEI, casualties, property damage, and much more.
![volcano](https://wikitravel.org/upload/shared//9/99/Volcano_de_Fuego_Banner.jpg)

#### **Objective of the Assignment:**


We will proceed directly to exploring these volcanic datasets, with the aim of enhancing our proficiency in Pandas and SQL.

For your reference, the [Pandas Documentation](https://pandas.pydata.org/docs/user_guide/index.html) will be an invaluable resource. Additionally, we have provided several helpful links to assist you throughout this process. Please proceed with caution to avoid any potential pitf

---------------------

### **DO NOT REMOVE ANY PART OF ANY OF THE QUESTIONS OR YOU LOSE CREDIT**
### *No Hardcoding either*  
### **REMEMBER TO SHOW ALL CODE OUTPUT (NO CREDIT OTHERWISE)**

### **Part 1: Maintenance  (25 POINTS TOTAL)**

First, in this section, we will focus on the initial steps of the process.

As is standard practice in Python programming, it is best to import necessary modules at the beginning of your script before writing any additional code. This approach ensures that all required libraries are available from the start.

In [1]:
# Make sure these code blocks run properly and that you have properly installed the appropriate modules required.
import pandas as pd
import requests
# import other libraries here

# Don't remove this
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

As you may have noticed, there is an additional library, apart from Pandas, called "[requests](https://requests.readthedocs.io/en/latest/)."

**The requests library enables you to send HTTP requests to a server, retrieve content, and process it with ease.**  It is particularly user-friendly for beginners venturing into web scraping, which is crucial for collecting and constructing datasets. Additionally, we recommend exploring [BeautifulSoup](https://beautiful-soup-4.readthedocs.io/en/latest/), , a complementary library that can be used alongside requests for more efficient web scraping.

* As shown below, sometimes specific websites require specific headers in order to process a request to access the data.

* To check if a request was processed successfully, use the [status_code](https://requests.readthedocs.io/en/latest/api/) function to see if the process returned 200.

In [2]:
# API URL and headers in case request gets denied.
api_url = "https://www.ngdc.noaa.gov/hazel/hazard-service/api/v1/volcanoes"

headers = {
    'accept': '*/*'
}

#### **TASK 1.0: Webscraping (5 points)**

To develop our web scraper, we need to **initiate a GET request** a GET request using the relevant information provided above.

This specific NOAA dataset API returns data in JSON format when a request is made. The JSON data is structured in a particular format, so we will extract the necessary information solely from the field named "items" to construct a DataFrame.

**After successfully scraping the data, name the resulting DataFrame** ***df***

**Subsequently, save this DataFrame to a CSV file named volcanoes.csv.**

**This process should only need to be executed once.**

In [3]:
response = requests.get(api_url, headers=headers)
print(response.status_code)

500

In [4]:
if response.status_code == 200:
    data = response.json()
    df = pd.DataFrame(data['items'])
    df.to_csv('volcanoes.csv', index=False)
    print("Data saved to volcanoes.csv")
    print(df.shape)
else:
    print("Request failed with status code:", response.status_code)

Request failed with status code: 500

#### **TASK 1.1: 1-Liner Overview (3 points)**
To gain an understanding of the dataset's structure, we need to examine some fundamental characteristics of the DataFrame. We need to get an idea of what this dataset is going to look. In order to do that, let's take a look at some of the most [basic things](https://dataanalytics.buffalostate.edu/pandas-cheat-sheet) our dataframe has.


***CAN'T USE LOOPS. DO NOT DISPLAY THE DATAFRAME, JUST YOUR CODE OUTPUT HERE.***

**1.1.1:** *In one line of code and **using only one function**, show how many **total datapoints and features** there are in the dataframe **together**.*

In [5]:
print(f'total datapoints = {df.shape[0]} || total features = {df.shape[1]}')

NameError: name 'df' is not defined

**1.1.2:** *In one line of code, list the **names** of all the **features** in the dataframe.*

In [ ]:
print(list(df.columns))

We won't be using some of the data because there is a lot of missing data.

**1.1.3:** *In one line of code, create a **new dataframe** called **new_df** that **contains all** the features of the **old** dataframe **except the following**:*

volcanoLocationNum, location, latitude, longitude, agent, significant,	publish,	eruption,	status, timeErupt, damageAmountOrder, damageAmountOrderTotal, housesDestroyedAmountOrder,	housesDestroyedAmountOrderTotal, housesDestroyed,	housesDestroyedTotal,	missingAmountOrder,	missingAmountOrderTotal,	missing,	missingTotal, damageMillionsDollars, damageMillionsDollarsTotal, injuries, injuriesAmountOrder, injuriesTotal, injuriesAmountOrderTotal, deathsAmountOrderTotal, and deathsAmountOrder.

In [ ]:
new_df = df.drop(columns=[
    'volcanoLocationNum', 'location', 'latitude', 'longitude', 'agent',
    'significant', 'publish', 'eruption', 'status', 'timeErupt', 'damageAmountOrder',
    'damageAmountOrderTotal', 'housesDestroyedAmountOrder', 'housesDestroyedAmountOrderTotal',
    'housesDestroyed', 'housesDestroyedTotal', 'missingAmountOrder', 'missingAmountOrderTotal', 'missing',
    'missingTotal', 'damageMillionsDollars', 'damageMillionsDollarsTotal', 'injuries', 'injuriesAmountOrder',
    'injuriesTotal', 'injuriesAmountOrderTotal', 'deathsAmountOrderTotal',  'deathsAmountOrder'])
new_df

#### **TASK 1.2: 1 Liner Shenaniganz (7 points)**

We're going to tidy up the **new dataframe** a little more with some more advanced 1 liner code.

**Read the directions carefully and code your answer with only one line of code.**

**For this section, keep the method of display that is already in the box. Write your code as indicated.**

***YOU CAN'T USE ONE LINE LOOPS OR ANY KIND OF LOOP.***

**1.2.1:** *In one line of code, **discard any row** that contains **NaN** in **any one** of the columns indicating **time**.*

In [ ]:
new_df.dropna(subset=['year', 'month', 'day'], inplace = True)
new_df

**1.2.2:** *In one line of code, **reset** the **index column** of the dataframe so that it has **1-based indexing**.*

In [ ]:
new_df = new_df.reset_index(drop=True)
new_df

The **deathsTotal** and **deaths**  columns have approximations of the same data with alternating NaNs in each.

**1.2.3:** *In one line of code, make a **new column** called **'totalDeaths'** that takes the **max** of the values given between those* ***two*** *columns. If there is* ***NaN*** *in* ***one column*** *and a* ***numerical*** *value in the* ***other***, *it will ***take the numerical value***. ***Only*** if there are* ***NaNs*** *in* ***both*** *columns, the* ***new column will have NaN.***

In [ ]:
new_df['totalDeaths'] = new_df[['deaths', 'deathsTotal']].max(axis=1)
new_df

#### **TASK 1.3: Tailoring Time (10 Points)**

The year, month, and day columns in the dataset appear to be in an unconventional format. We will need to undertake some fundamental data cleaning on the [time](https://pandas.pydata.org/docs/user_guide/timeseries.html). While more advanced data cleaning techniques will be covered in class, we will focus on basic cleaning for now.

**We need to have only ONE column called** "***date***" **that contains the full date (YYYY-MM-DD), not separated into three columns.**

***Ensure that there are no floating-point values in the date and sort the data from the most recent to the least recent.***

***Remove the old columns and place the new column next to the 'id' column.***


**YOU MAY USE MULTIPLE LINES OF CODE, BUT CAN'T USE LOOPS.**
**Note:** It is alright to have only a **maximum of 12 NaT (Not a Time)s** for some dates that often go further back than the 1600s because the datetime module in Pandas has a limit (unless otherwise guided).

In [ ]:
# typecastings
new_df['year'] = new_df['year'].astype(int).astype(str)
new_df['month'] = new_df['month'].astype(int).astype(str)
new_df['day'] = new_df['day'].astype(int).astype(str)

# creating new date col
new_df['date'] = new_df['year'] + '-' + new_df['month'] + '-' + new_df['day']
new_df['date'] = pd.to_datetime(new_df['date'], errors='coerce')

# rearranging the cols
new_df = new_df[
                ['id', 'year', 'month', 'day', 'date', 'tsunamiEventId', 'earthquakeEventId',
       'volcanoLocationId', 'volcanoLocationNewNum', 'name', 'country',
       'elevation', 'morphology', 'deathsTotal', 'vei', 'deaths',
       'totalDeaths']
                ]

# sorting and dropping
new_df = new_df.sort_values(by='date', ascending=False)
new_df = new_df.drop(columns=['year', 'month', 'day'])

new_df

### **Part 2: Volcanic Matryoshkas  (20 POINTS TOTAL)**

Now, that most of the data has been tidied up. We will organize the data into more sizable pieces of information in order to extract useful information.

**2.1.1:** *(5 points here)*

**Use the groupby function in Pandas to create separate dataframes for each unique country.**

* Each table must only have the columns: 'date' 'country', 'name', and 'vei'

* Sort the dataframe of each country by highest to lowest 'vei'

**You MUST use the groupby function here.**

In [ ]:
grouped = new_df.groupby('country')

for country, data in grouped:
    country_df = data[['date', 'country', 'name', 'vei']].sort_values(by='vei', ascending=False)
    print(f" ############################### DataFrame for {country} ############################### ")
    print(country_df)  # Or store these DataFrames in a dictionary or list if needed

**2.1.2:** *(5 points here)*

**Using groupby again, print out the maximum 'vei' for each unique country.**

**You MUST use the groupby function here.**

* Print out your results in a format like the following: "Country: {country_name}, Highest VEI: {vei}"

In [ ]:
max_vei_by_country = new_df.groupby('country')['vei'].max()
for country, vei in max_vei_by_country.items():
    print(f"Country: {country}, Highest VEI: {vei}")

**2.1.3:** *(10 points here)*

Finally, we have ALMOST REACHED THE END!!
Since there is still quite a bit of missing data, we want to make use of what is still available.

A very powerful tool in Python's magnificent collection of libraries is its beautiful graphing tools.

Check out libraries such as [Seaborn](https://seaborn.pydata.org/) or [Matplotlib](https://matplotlib.org/stable/index.html) to create meaningful visualizations! **Your final task requires the use of these libraries**

**Based on the unique names of volcanos, filter names that have more than 3 datapoints under their name.**

* Make separate graphs for each volcano and plot their VEIs over time.

* Make sure to properly label all parts of the graph.

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns

volcano_counts = new_df['name'].value_counts()
volcano_names = volcano_counts[volcano_counts > 3].index

for volcano in volcano_names:
    volcano_data = new_df[new_df['name'] == volcano]

    plt.figure(figsize=(10, 6))
    sns.lineplot(x='date', y='vei', data=volcano_data)

    plt.title(f'VEI over Time for {volcano}')
    plt.xlabel('Date')
    plt.ylabel('VEI')
    plt.show()

### **Part 3: Fiery Jobs  (15 POINTS TOTAL)**

Proficiency in SQL is also super important. SQL databases are essentially relational databases in which there are vast amounts of tabular data. which can often be used to connect with related tablular data. [This](https://www.w3schools.com/sql/) is a pretty good intro into learning more about SQL.

Check out this [tutorial](https://mode.com/sql-tutorial/introduction-to-sql/) for some clarifications on SQL.

Now! We'll be using **sqlite** to access a database.
* Start by downloading the sql lite file and putting it in the same directory as this [notebook](https://www.kaggle.com/datasets/kaggle/sf-salaries) (hit the 'download' button in the upper right).
* Check out the description of the data so you know the table / column names.

The following code will use sqlite3 to create a database connection. sqlite3 is the library in Python that assists in navigating through SQL databases.

In [ ]:
import sqlite3
# import pandas as pd. Pandas was already imported from the previous sections

conn = sqlite3.connect("database.sqlite")
crsr = conn.cursor()

In [ ]:
# uploading the data to the server
salary_df = pd.read_csv('Salaries.csv')
salary_df.to_sql('Salaries', conn, if_exists='replace', index=False)

In [ ]:
# This code will let you check out the different tables within the database.
query = "SELECT name FROM sqlite_master WHERE type='table';"
tables = crsr.execute(query).fetchall()
print(tables)

##### **Remember that each problem should be solved with a single sql query.**
**All outputs must be shown**

#### **3.1.1: 2 Points**
***From the Salaries table, get the average base pay for "firefighters" (all job titles consisting of the word "firefighter" (not case sensitive)) between the year 2011 to 2013.***

In [ ]:
query = '''SELECT AVG(BasePay)
FROM Salaries
WHERE JobTitle LIKE '%firefighter%'
AND Year BETWEEN 2011 AND 2013
'''
df = pd.read_sql(query, conn)
df

#### **3.1.2: 2 Points**
***From the Salaries table, create a table for the year 2014, with a job title of "firefighters" (all job titles consisting of the word "firefighter" (not case sensitive)) making under $100,000 as a base pay, and sort in descending order by salary.***

In [ ]:
query = '''
SELECT *
FROM Salaries
WHERE JobTitle LIKE '%firefighter%'
AND Year = 2014
AND BasePay < 100000
ORDER BY BasePay DESC
'''
df = pd.read_sql(query, conn)
df

#### **3.1.3: 4 Points**
***Create a dataframe with averages of base pay, averages of benefits, and averages of overtime for "firefighters" (all job titles consisting of the word "firefighter" (not case sensitive)) as well as a column with the sum of these three values.***

***Exclude job titles containing "FIREFIGHTER" (case-sensitive)***

In [ ]:
query = '''
SELECT
   AVG(BasePay) AS AverageBasePay,
   AVG(Benefits) AS AverageBenefits,
   AVG(OvertimePay) AS AverageOvertimePay,
   AVG(BasePay) + AVG(Benefits) + AVG(OvertimePay) AS TotalAverageCompensation
FROM Salaries
WHERE JobTitle LIKE '%firefighter%'
AND JobTitle != 'FIREFIGHTER'
'''

df = pd.read_sql(query, conn)
df

#### **3.1.4: 7 Points**

***Finally, we'll create our own table in our database. Separate the Salaries table by years, and add it back to the database. Using a loop might be helpful.***

* You may use basic python to complete the task. However, using querying on SQL is **mandatory**.
* Feel free to **use multiple lines of code for this problem only.**
* Check out this [Hint](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_sql.html)

In [ ]:
for year in salary_df['Year'].unique():
    year_df = salary_df[salary_df['Year'] == year]
    year_df.to_sql(f'Salaries_{year}', conn, if_exists='replace', index=False)

In [ ]:
# Run this code to check if you successfully added your table.
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

![volcano](https://as1.ftcdn.net/v2/jpg/06/34/76/64/1000_F_634766457_0fZbpYj6aBLlldO1jADUPpKTRLnNmngs.jpg)

### **Part 4: Be Creative with SQL  (20 POINTS TOTAL)**

For a more interactive SQL experience within a Jupyter notebook or Google Colab, you can use the %sql magic command from the ipython-sql extension. Here's how:

* Install ipython-sql: !pip install ipython-sql
* Load the extension and connect to SQLite:

%load_ext sql

%sql sqlite:///restaurent.db


* Run SQL queries directly in cells using

%%sql

However, you can also continue to import the sqlite3 library and create a connection and cursor to execute SQL commands, as you did before. The choice is up to you.

*** Part 4.1(a)  CREATE A TABLE ***

Create a table called **MyRestaurants** with the following attributes:

* RestaurantName: A VARCHAR field
* FoodType: A VARCHAR field
* DistanceFromHome: An INTEGER field representing the distance (in minutes) from your house
* LastVisitDate: A DATE field representing the date of your last visit
* Liked: A BOOLEAN field indicating whether you like the restaurant or not

In [ ]:
sql = '''CREATE TABLE MyRestaurants (
  RestaurantName VARCHAR(255),
  FoodType VARCHAR(255),
  DistanceFromHome INTEGER,
  LastVisitDate DATE,
  Liked BOOLEAN
);
'''
crsr.execute(sql)
conn.commit()

In [ ]:
# This code will let you check out the different tables within the database.
query = "SELECT name FROM sqlite_master WHERE type='table';"
tables = crsr.execute(query).fetchall()
print(tables)

*** Part 4.1(b) Insert Tuples ***

Insert at least five tuples using the SQL INSERT command, executing it five (or more) times.

* Ensure that you insert ** at least one restaurant that you liked**, **at least one restaurant that you did not like**, and **at least one restaurant where the Liked field is set to NULL**.

In [ ]:
sql = '''INSERT INTO MyRestaurants
(RestaurantName, FoodType, DistanceFromHome, LastVisitDate, Liked)
VALUES ('Mc Burgers', 'American', 45, '2024-05-01', 0);'''
crsr.execute(sql)
conn.commit()

In [ ]:
sql = '''INSERT INTO MyRestaurants
(RestaurantName, FoodType, DistanceFromHome, LastVisitDate, Liked)
VALUES ('House of Sushis', 'Japanese', 105, '2024-06-10', 1);'''
crsr.execute(sql)
conn.commit()

In [ ]:
sql = '''INSERT INTO MyRestaurants
(RestaurantName, FoodType, DistanceFromHome, LastVisitDate, Liked)
VALUES ('Taco Bell', 'Mexican', 920, '2024-07-15', 0);
'''
crsr.execute(sql)
conn.commit()

In [ ]:
sql = '''INSERT INTO MyRestaurants
(RestaurantName, FoodType, DistanceFromHome, LastVisitDate, Liked)
VALUES ('Momo King', 'Thai', 425, '2024-08-01', 1);
'''
crsr.execute(sql)
conn.commit()

In [ ]:
sql = '''INSERT INTO MyRestaurants
(RestaurantName, FoodType, DistanceFromHome, LastVisitDate, Liked)
VALUES ('Pizza Hut', 'Italian', 110, '2024-09-12', 1);
'''
crsr.execute(sql)
conn.commit()

*** Part 4.1(c) ***

Write a SQL query to return all restaurants in your table.

In [ ]:
query = '''SELECT *
FROM MyRestaurants
'''
df = pd.read_sql(query, conn)
df

*** Part 4.1(d) ***

Now experiment with a few of SQLite's output formats using the SQL query you wrote for question above:

* print the results (Part 4.1(c)) in list form, delimited by " | "

Sample output: Sushi Place | Japanese | 15 | 2024-05-01 | 1

In [ ]:
sql = '''SELECT
  RestaurantName || ' | ' ||
  FoodType || ' | ' ||
  DistanceFromHome || ' | ' ||
  LastVisitDate || ' | ' ||
  Liked as temp
FROM MyRestaurants;
'''
df = pd.read_sql(sql, conn)
df

*** Part 4.1(d) ***

Modify your SQL query such that it prints "I liked it" or "I hated it" for each restaurant you liked or not.


Note that you are not allowed to modify the table on disk. You should be able to answer this question using only a SELECT statement. A solution that creates and uses an extra table, howerver, will be accepted.

Check: https://www.sqlitetutorial.net/sqlite-case/

In [ ]:
sql = '''SELECT
  RestaurantName,
  CASE
    WHEN Liked = 1 THEN 'I liked it'
    WHEN Liked = 0 THEN 'I hated it'
    ELSE 'I have no opinion'
  END AS MyOpinion
FROM MyRestaurants;
'''
df = pd.read_sql(sql, conn)
df

*** Part 4.1(e) ***

Write a SQL query to return all restaurants that you like but have not visited in the past three months.

In [ ]:
sql = '''SELECT RestaurantName
FROM MyRestaurants
WHERE Liked = 1
AND LastVisitDate < date('now', '-3 months');
'''
df = pd.read_sql(sql, conn)
df

*** Part 4.2(a) ***

** Next we will focus on INNER JOIN **

Let's add a second table called **"RestaurantReviews"** and demonstrate how to perform an inner join between MyRestaurants and RestaurantReviews.

Create the RestaurantReviews Table
First, we'll create the RestaurantReviews table with the following attributes:

* RestaurantName (to match the Name in MyRestaurants)
* ReviewText (text of the review)
* Rating (integer rating)

In [ ]:
sql = '''CREATE TABLE RestaurantReviews (
  RestaurantName VARCHAR(255),
  ReviewText TEXT,
  Rating INTEGER
);
'''
crsr.execute(sql)
conn.commit()

In [ ]:
# This code will let you check out the different tables within the database.
query = "SELECT name FROM sqlite_master WHERE type='table';"
tables = crsr.execute(query).fetchall()
print(tables)

*** Part 4.2(b) ***

Insert Data into RestaurantReviews
Insert some sample data (at least 5) into this table:

In [ ]:
sql = '''
INSERT INTO RestaurantReviews
(RestaurantName, ReviewText, Rating)
VALUES ('House of Sushis', 'The best sushi in town! Fresh and delicious.', 5);
'''
crsr.execute(sql)
conn.commit()

In [ ]:
sql = '''INSERT INTO RestaurantReviews
(RestaurantName, ReviewText, Rating)
VALUES ('Mc Burgers', 'Decent burgers, but the fries were cold.', 3);'''
crsr.execute(sql)
conn.commit()

In [ ]:
sql = '''
INSERT INTO RestaurantReviews
(RestaurantName, ReviewText, Rating)
VALUES ('Taco Bell', 'Classic Taco Bell - always hits the spot.', 4);
'''
crsr.execute(sql)
conn.commit()

In [ ]:
sql = '''
INSERT INTO RestaurantReviews
(RestaurantName, ReviewText, Rating)
VALUES ('Momo King', 'Amazing momos and friendly service.', 5);
'''
crsr.execute(sql)
conn.commit()

In [ ]:
sql = '''
INSERT INTO RestaurantReviews
(RestaurantName, ReviewText, Rating)
VALUES ('Pizza Hut', 'Good pizza, but a bit pricey.', 4);
'''
crsr.execute(sql)
conn.commit()

In [ ]:
query = '''SELECT *
FROM RestaurantReviews
'''
df = pd.read_sql(query, conn)
df

*** Part 4.2(c) Inner Join Query ***
Now perform an inner join between MyRestaurants and RestaurantReviews based on the restaurant name to combine the information from both tables and show the results.

In [ ]:
sql = '''
SELECT a.*, b.*
FROM RestaurantReviews as a

INNER JOIN MyRestaurants as b
ON a.RestaurantName = b.RestaurantName;
'''
df = pd.read_sql(sql, conn)
df

## THE END OF HW 1 ##